In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],'key2':['one', 'two', 'one', 'two', 'one'], 'data1' : np.linspace(300,500,5),'data2' : np.random.randn(5)})
df

  key1 key2  data1     data2
0    a  one  300.0  0.207977
1    a  two  350.0  0.173434
2    b  one  400.0  0.639988
3    b  two  450.0 -1.154315
4    a  one  500.0  0.540734

 Data Aggregation and Group Operations
A list or array of values that is the same length as the axis being grouped
A value indicating a column name in a DataFrame
A dict or Series giving a correspondence between the values on the axis being
grouped and the group names
A function to be invoked on the axis index or the individual labels in the index

In [2]:
group_df = df['data1'].groupby(df['key1'])
group_df
group_df.mean()

key1
a    383.333333
b    425.000000
Name: data1, dtype: float64

In [3]:

means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     400.0
      two     350.0
b     one     400.0
      two     450.0
Name: data1, dtype: float64

In [4]:
means.unstack()

key2    one    two
key1
a     400.0  350.0
b     400.0  450.0

In [5]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    350.0
            2006    400.0
Ohio        2005    375.0
            2006    500.0
Name: data1, dtype: float64

In [6]:
df['key1']

0    a
1    a
2    b
3    b
4    a
Name: key1, dtype: object

In [7]:
df.groupby('key1').mean()

           data1     data2
key1
a     383.333333  0.376386
b     425.000000  0.106627

In [8]:
df.groupby(['key1','key2']).mean()

           data1     data2
key1 key2
a    one   400.0 -0.158978
     two   350.0  1.447112
b    one   400.0  2.406825
     two   450.0 -2.193571

In [9]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [10]:
for name,group in df.groupby(['key1','key2']):
    print(name)
    print( group)

('a', 'one')
  key1 key2  data1     data2
0    a  one  300.0 -1.078200
4    a  one  500.0  0.760245
('a', 'two')
  key1 key2  data1     data2
1    a  two  350.0  1.447112
('b', 'one')
  key1 key2  data1     data2
2    b  one  400.0  2.406825
('b', 'two')
  key1 key2  data1     data2
3    b  two  450.0 -2.193571

In [11]:
chunk=dict(list(df.groupby('key1')))
chunk

{'a':   key1 key2  data1     data2
 0    a  one  300.0 -1.078200
 1    a  two  350.0  1.447112
 4    a  one  500.0  0.760245,
 'b':   key1 key2  data1     data2
 2    b  one  400.0  2.406825
 3    b  two  450.0 -2.193571}

In [12]:
chunk['b']

  key1 key2  data1     data2
2    b  one  400.0  2.406825
3    b  two  450.0 -2.193571

In [13]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [14]:
group_df1=df.groupby(df.dtypes)

In [15]:
group_df1

In [16]:
dict(list(group_df1))

{}

In [17]:
df.groupby('key1')['data1'].mean()

key1
a    383.333333
b    425.000000
Name: data1, dtype: float64

In [18]:
p1=pd.DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],index=['p','q','r','s','t'])

In [19]:
p1

          a         b         c         d         e
p -0.553578  2.281708  1.350164 -1.301362 -0.772395
q  0.434114  0.135976  0.166522 -1.090826  1.640819
r  0.144104 -1.234717 -2.196156 -0.156056 -0.646523
s -0.599497 -1.782331 -2.297074 -0.666383  0.629968
t  0.646008 -1.354656 -1.329335  0.873152 -0.414575

In [20]:
mapp={'a':'red','b': 'red','c':'blue','d':'blue','e':'red','f':'orange'}
by_col=p1.groupby(mapp,axis=1)

In [21]:
by_col.sum()

       blue       red
p  0.048801  0.955734
q -0.924304  2.210909
r -2.352212 -1.737136
s -2.963457 -1.751861
t -0.456183 -1.123222

In [22]:
by_col.count()

   blue  red
p     2    3
q     2    3
r     2    3
s     2    3
t     2    3

In [23]:
p1.groupby(len).sum()

          a         b         c         d         e
1  0.071151 -1.954021 -4.305879 -2.341475  0.437294

In [24]:
lk=['one','one','one','two','two']
p1.groupby([len,lk]).min()

              a         b         c         d         e
1 one -0.553578 -1.234717 -2.196156 -1.301362 -0.772395
  two -0.599497 -1.782331 -2.297074 -0.666383 -0.414575

In [25]:
cols=pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],[1,3,5,1,3]],names=['city','tenor'])

In [26]:
cols

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['city', 'tenor'])

In [27]:
hier_df=pd.DataFrame(np.random.randn(4,5),columns=cols)

In [28]:
hier_df

city         US                            JP
tenor         1         3         5         1         3
0      2.400547 -0.512148 -0.637859 -0.731182  1.491683
1      1.093024  0.477890 -1.237108  0.603767  1.843625
2     -0.196079  0.829109  0.607447 -0.305203 -0.217871
3     -1.056443  0.916856 -0.292723  1.344411  1.576577

In [29]:
hier_df.groupby(level='city',axis=1).count()

city  JP  US
0      2   3
1      2   3
2      2   3
3      2   3

In [30]:
p1.describe()

              a         b         c         d         e
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.014230 -0.390804 -0.861176 -0.468295  0.087459
std    0.568195  1.658114  1.581877  0.868585  1.029242
min   -0.599497 -1.782331 -2.297074 -1.301362 -0.772395
25%   -0.553578 -1.354656 -2.196156 -1.090826 -0.646523
50%    0.144104 -1.234717 -1.329335 -0.666383 -0.414575
75%    0.434114  0.135976  0.166522 -0.156056  0.629968
max    0.646008  2.281708  1.350164  0.873152  1.640819

In [31]:
df

  key1 key2  data1     data2
0    a  one  300.0 -1.078200
1    a  two  350.0  1.447112
2    b  one  400.0  2.406825
3    b  two  450.0 -2.193571
4    a  one  500.0  0.760245

In [32]:
group_df

In [33]:
df['data1'].quantile(.7)

440.0

In [34]:
df.describe()

            data1     data2
count    5.000000  5.000000
mean   400.000000  0.268482
std     79.056942  1.876084
min    300.000000 -2.193571
25%    350.000000 -1.078200
50%    400.000000  0.760245
75%    450.000000  1.447112
max    500.000000  2.406825

In [35]:
np.arange(2,8,1)

array([2, 3, 4, 5, 6, 7])

In [36]:
np.arange(12).reshape(3,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [37]:
np.matrix(4,3)

TypeError: data type not understood

In [ ]:
np.random.randn(12).reshape(3,4)

In [ ]:
df.iloc[1]

In [ ]:
i=0
def change(i):
   i=i+1
   return i
change(1)
print(i)

In [ ]:
import seaborn as sns
import pandas as pd

tips['tip_pct'] = tips['tip'] / (tips['total_bill'] - tips['tip'])
tips.head()

In [ ]:

tips=pd.read_csv("downloads/tips.csv")
tips

In [ ]:
sns.barplot(x='tip_pct', y='day', hue='time', data=tips, orient='h')

In [ ]:
sns.set(style="whitegrid")

In [ ]:
tips['tip_pct'].plot.hist(bins=50)

In [ ]:
tips['tip_pct'].plot.density()

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns
comp1 = np.random.normal(0, 1, size=200)
comp2 = np.random.normal(10, 2, size=200)
values = pd.Series(np.concatenate([comp1, comp2]))
sns.distplot(values, bins=100, color='k')

In [ ]:
comp2

In [ ]:
macro = pd.read_csv('documents/macrodata.csv')
data = macro[['cpi', 'm1', 'tbilrate', 'unemp']]
trans_data = np.log(data).diff().dropna()
trans_data[-5:]

In [ ]:
import matplotlib.pyplot as plt
sns.regplot('m1', 'unemp', data=trans_data)
plt.title('Changes in log %s versus log %s' % ('m1', 'unemp'))

In [ ]:
sns.pairplot(trans_data, diag_kind='kde', plot_kws={'alpha': 0.2})

In [ ]:
dir(np)

In [ ]:
help(np.random.normal)

In [ ]:
np.random.normal(3, 2.5, size=(2, 4))

Filling Missing Values with Group-Specific Values

In [38]:
tips = pd.read_csv('Downloads/tips.csv')
# Add tip percentage of total bill
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips[:6]
grouped = tips.groupby(['day', 'smoker'])
grouped_pct = grouped['tip_pct']
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [ ]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
result
result['tip_pct']

In [ ]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]
grouped['tip_pct', 'total_bill'].agg(ftuples)
grouped.agg({'tip' : np.max, 'size' : 'sum'})
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],
             'size' : 'sum'})

In [ ]:
#Returning Aggregated Data Without Row Indexes
tips.groupby(['day', 'smoker'], as_index=False).mean()
#Apply: General split-apply-combine
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]
top(tips, n=6)
tips.groupby('smoker').apply(top)
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')
result = tips.groupby('smoker')['tip_pct'].describe()
result

In [39]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [40]:
top(tips, n=6)

     total_bill   tip     sex smoker  day    time  size   tip_pct
109       14.31  4.00  Female    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39    Male     No  Sat  Dinner     2  0.291990
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

In [41]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [45]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')
result = tips.groupby('smoker')['tip_pct'].describe()
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [ ]:
Cross-Tabulations: Crosstab
from io import StringIO
data = """\
Sample  Nationality  Handedness
1   USA  Right-handed
2   Japan    Left-handed
3   USA  Right-handed
4   Japan    Right-handed
5   Japan    Left-handed
6   Japan    Right-handed
7   USA  Right-handed
8   USA  Left-handed
9   Japan    Right-handed
10  USA  Right-handed"""
data = pd.read_table(StringIO(data), sep='\s+')
data
pd.crosstab(data.Nationality, data.Handedness, margins=True)
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

In [ ]:
result.unstack('smoker')

In [53]:
grouped

In [52]:
f = lambda x: x.describe() 
grouped.apply(f)
#Suppressing the Group Keys
#tips.groupby('smoker', group_keys=False).apply(top)

data1
0      count    100.000000
       mean      -0.094698
       std        0.970082
       min       -2.996440
       25%       -0.806814
                   ...
9      min       -2.377253
       25%       -0.510791
       50%       -0.002357
       75%        0.674251
       max        2.594533
Name: data2, Length: 80, dtype: float64

In [48]:
#Quantile and Bucket Analysis
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})
quartiles = pd.cut(frame.data1, 4)
quartiles[:10]

0     (-0.118, 1.575]
1    (-1.811, -0.118]
2    (-1.811, -0.118]
3    (-1.811, -0.118]
4    (-1.811, -0.118]
5    (-1.811, -0.118]
6     (-0.118, 1.575]
7     (-0.118, 1.575]
8    (-1.811, -0.118]
9     (-0.118, 1.575]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.511, -1.811] < (-1.811, -0.118] < (-0.118, 1.575] < (1.575, 3.269]]

In [49]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}
grouped = frame.data2.groupby(quartiles)
grouped.apply(get_stats).unstack()

                       min       max  count      mean
data1
(-3.511, -1.811] -2.996440  1.527505   48.0 -0.267742
(-1.811, -0.118] -2.356066  2.364236  384.0 -0.006455
(-0.118, 1.575]  -3.365244  3.125513  509.0 -0.006528
(1.575, 3.269]   -2.377253  2.594533   59.0  0.061615

In [50]:
# Return quantile numbers
grouping = pd.qcut(frame.data1, 10, labels=False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -2.996440  2.081323  100.0 -0.094698
1     -2.356066  2.015340  100.0 -0.142436
2     -2.128898  2.364236  100.0  0.006622
3     -2.330812  1.944904  100.0 -0.019508
4     -3.012845  2.122220  100.0 -0.030213
5     -2.956497  2.421474  100.0 -0.115351
6     -2.632043  2.387996  100.0  0.079624
7     -2.884333  2.109358  100.0  0.087687
8     -3.365244  3.125513  100.0  0.035461
9     -2.377253  2.594533  100.0  0.042633

In [60]:
#Example: Filling Missing Values with Group-Specific Values
s = pd.Series(np.random.randn(6))
s[::2] = np.nan
s
s.fillna(s.mean())
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.Series(np.random.randn(8), index=states)
data
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data
#data.groupby(group_key).mean()
#fill_mean = lambda g: g.fillna(g.mean())
#data.groupby(group_key).apply(fill_mean)

Ohio          0.916145
New York      0.865644
Vermont            NaN
Florida      -0.566431
Oregon        1.343675
Nevada             NaN
California   -0.383195
Idaho              NaN
dtype: float64

In [ ]:
fill_values = {'East': 0.5, 'West': -1}
fill_func = lambda g: g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

In [58]:
fill_values = {'East': 0.5, 'West': -1}
fill_func = lambda g: g.fillna(fill_values[g.name])

In [59]:
data.groupby(group_key).apply(fill_func)

Ohio          1.664169
New York      0.297054
Vermont       0.500000
Florida       0.045362
Oregon       -0.655427
Nevada       -1.000000
California    0.064191
Idaho        -1.000000
dtype: float64

In [ ]:
#Example: Random Sampling and Permutation
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)
deck[:13]

In [ ]:
def draw(deck, n=5):
    return deck.sample(n)
draw(deck)
get_suit = lambda card: card[-1] # last letter is suit
deck.groupby(get_suit).apply(draw, n=2)
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

In [ ]:
#Example: Group Weighted Average and Correlation
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})
df
grouped = df.groupby('category')
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])
grouped.apply(get_wavg)

In [ ]:
close_px = pd.read_csv('Documents/stock_px_2.csv', parse_dates=True,
                       index_col=0)
spx_corr = lambda x: x.corrwith(x['SPX'])
rets = close_px.pct_change().dropna()
rets

In [ ]:
get_year = lambda x: x.year
by_year = rets.groupby(get_year)
by_year.apply(spx_corr)
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

In [ ]:
#Example: Group-Wise Linear Regression
import statsmodels.api as sm
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params
by_year.apply(regress, 'AAPL', ['SPX'])

In [ ]:
##Pivot Tables and Cross-Tabulation
tips.pivot_table(index=['day', 'smoker'])
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker')
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker', margins=True)
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
                 aggfunc=len, margins=True)
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                 columns='day', aggfunc='mean', fill_value=0)

In [ ]:
#Cross-Tabulations: Crosstab
from io import StringIO
data = """\
Sample  Nationality  Handedness
1   USA  Right-handed
2   Japan    Left-handed
3   USA  Right-handed
4   Japan    Right-handed
5   Japan    Left-handed
6   Japan    Right-handed
7   USA  Right-handed
8   USA  Left-handed
9   Japan    Right-handed
10  USA  Right-handed"""
data = pd.read_table(StringIO(data), sep='\s+')
data
pd.crosstab(data.Nationality, data.Handedness, margins=True)
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)
#pd.options.display.max_rows = PREVIOUS_MAX_ROWS